/* package up error # */
"error %1$d" = "błąd %1$d";
"error %1$#x" = "błąd %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Nieznany błąd: 0";

/* errno error 1 */
"Operation not permitted" = "Operacja nie jest dozwolona";

/* errno error 2 */
"No such file or directory" = "Brak takiego pliku lub katalogu";

/* errno error 3 */
"No such process" = "Brak takiego procesu";

/* errno error 4 */
"Interrupted system call" = "Przerwane wołanie systemowe";

/* errno error 5 */
"Input/output error" = "Błąd we/wy";

/* errno error 6 */
"Device not configured" = "Urządzenie nie jest skonfigurowane";

/* errno error 7 */
"Argument list too long" = "Lista argumentów za długa";

/* errno error 8 */
"Exec format error" = "Błąd formatu wykonywalnego pliku";

/* errno error 9 */
"Bad file descriptor" = "Zły deskryptor pliku";

/* errno error 10 */
"No child processes" = "Brak procesów potomnych";

/* errno error 11 */
"Resource deadlock avoided" = "Uniknięto zakleszczenia zasobów";

/* errno error 12 */
"Cannot allocate memory" = "Nie można przydzielić pamięci";

/* errno error 13 */
"Permission denied" = "Odmowa uprawnień";

/* errno error 14 */
"Bad address" = "Zły adres";

/* errno error 15 */
"Block device required" = "Wymagane urządzenie blokowe";

/* errno error 16 */
"Resource busy" = "Zasoby są używane";

/* errno error 17 */
"File exists" = "Plik istnieje";

/* errno error 18 */
"Cross-device link" = "Połączenie między urządzeniami";

/* errno error 19 */
"Operation not supported by device" = "Operacja nie jest obsługiwana przez urządzenie";

/* errno error 20 */
"Not a directory" = "To nie katalog";

/* errno error 21 */
"Is a directory" = "Jest katalogiem";

/* errno error 22 */
"Invalid argument" = "Niewłaściwy argument";

/* errno error 23 */
"Too many open files in system" = "Zbyt wiele otwartych plików w systemie";

/* errno error 24 */
"Too many open files" = "Zbyt wiele otwartych plików";

/* errno error 25 */
"Inappropriate ioctl for device" = "Niewłaściwy ioctl dla urządzenia";

/* errno error 26 */
"Text file busy" = "Plik tekstowy używany";

/* errno error 27 */
"File too large" = "Plik zbyt duży";

/* errno error 28 */
"No space left on device" = "Brak miejsca na urządzeniu";

/* errno error 29 */
"Illegal seek" = "Nielegalne wyszukiwanie";

/* errno error 30 */
"Read-only file system" = "System plików tylko do odczytu";

/* errno error 31 */
"Too many links" = "Zbyt wiele połączeń";

/* errno error 32 */
"Broken pipe" = "Przerwany potok";

/* errno error 33 */
"Numerical argument out of domain" = "Argument liczbowy spoza zakresu";

/* errno error 34 */
"Result too large" = "Wynik zbyt duży";

/* errno error 35 */
"Resource temporarily unavailable" = "Zasoby czasowo niedostępne";

/* errno error 36 */
"Operation now in progress" = "Operacja właśnie trwa";

/* errno error 37 */
"Operation already in progress" = "Operacja właśnie trwa";

/* errno error 38 */
"Socket operation on non-socket" = "Operacja na nieznanym obiekcie typu gniazdo";

/* errno error 39 */
"Destination address required" = "Wymagany adres docelowy";

/* errno error 40 */
"Message too long" = "Komunikat zbyt długi";

/* errno error 41 */
"Protocol wrong type for socket" = "Protokół złego typu dla tego gniazda";

/* errno error 42 */
"Protocol not available" = "Protokół nie jest dostępny";

/* errno error 43 */
"Protocol not supported" = "Protokół nie jest obsługiwany";

/* errno error 44 */
"Socket type not supported" = "Nieobsługiwany typ gniazda";

/* errno error 45 */
"Operation not supported" = "Operacja nie jest obsługiwana";

/* errno error 46 */
"Protocol family not supported" = "Rodzina protokołów nieobsługiwana";

/* errno error 47 */
"Address family not supported by protocol family" = "Rodzina adresów nie jest obsługiwana przez rodzinę protokołów";

/* errno error 48 */
"Address already in use" = "Adres już jest używany";

/* errno error 49 */
"Can't assign requested address" = "Nie można przydzielić wymaganego adresu";

/* errno error 50 */
"Network is down" = "Sieć jest nieczynna";

/* errno error 51 */
"Network is unreachable" = "Sieć jest nieosiągalna";

/* errno error 52 */
"Network dropped connection on reset" = "Podczas zerowania utracono połączenie";

/* errno error 53 */
"Software caused connection abort" = "Program spowodował przerwanie połączenia";

/* errno error 54 */
"Connection reset by peer" = "Połączenie wyzerowane przez komputer";

/* errno error 55 */
"No buffer space available" = "Brak miejsca na bufor";

/* errno error 56 */
"Socket is already connected" = "Gniazdo już jest podłączone";

/* errno error 57 */
"Socket is not connected" = "Gniazdo nie jest podłączone";

/* errno error 58 */
"Can't send after socket shutdown" = "Nie można wysyłać po wyłączeniu gniazda";

/* errno error 59 */
"Too many references: can't splice" = "Zbyt wiele odsyłaczy: nie można połączyć";

/* errno error 60 */
"Operation timed out" = "Przekroczenie limitu czasu dla operacji";

/* errno error 61 */
"Connection refused" = "Połączenie odrzucone";

/* errno error 62 */
"Too many levels of symbolic links" = "Zbyt wiele poziomów połączeń symbolicznych";

/* errno error 63 */
"File name too long" = "Zbyt długa nazwa pliku";

/* errno error 64 */
"Host is down" = "Host jest wyłączony";

/* errno error 65 */
"No route to host" = "Brak trasy do hosta";

/* errno error 66 */
"Directory not empty" = "Katalog nie jest pusty";

/* errno error 67 */
"Too many processes" = "Zbyt wiele procesów";

/* errno error 68 */
"Too many users" = "Zbyt wielu użytkowników";

/* errno error 69 */
"Disc quota exceeded" = "Przekroczony limit przydziału";

/* errno error 70 */
"Stale NFS file handle" = "Nieaktualne dowiązanie do pliku NFS";

/* errno error 71 */
"Too many levels of remote in path" = "Zbyt wiele poziomów oddalenia w ścieżce";

/* errno error 72 */
"RPC struct is bad" = "Struktura RPC jest niewłaściwa";

/* errno error 73 */
"RPC version wrong" = "Zła wersja RPC";

/* errno error 74 */
"RPC prog. not avail" = "Brak prog. RPC";

/* errno error 75 */
"Program version wrong" = "Zła wersja programu";

/* errno error 76 */
"Bad procedure for program" = "Zła procedura dla programu";

/* errno error 77 */
"No locks available" = "Brak dostępnych blokad";

/* errno error 78 */
"Function not implemented" = "Funkcja niezaimplementowana";

/* errno error 79 */
"Inappropriate file type or format" = "Niewłaściwy typ lub format pliku";

/* errno error 80 */
"Authentication error" = "Błąd uwierzytelnienia";

/* errno error 81 */
"Need authenticator" = "Potrzebna autoryzacja";

/* errno error 82 */
"Device power is off" = "Zasilanie urządzenia jest wyłączone";

/* errno error 83 */
"Device error" = "Błąd urządzenia";

/* errno error 84 */
"Value too large to be stored in data type" = "Wartość zbyt duża dla tego typu danych";

/* errno error 85 */
"Bad executable (or shared library)" = "Zły plik wykonywalny (lub wspólna biblioteka)";

/* errno error 86 */
"Bad CPU type in executable" = "Zły typ CPU w zmiennych";

/* errno error 87 */
"Shared library version mismatch" = "Niezgodność wersji wspólnych bibliotek";

/* errno error 88 */
"Malformed Mach-o file" = "Zniekształcony plik Mach-o";

/* errno error 89 */
"Operation canceled" = "Operacja anulowana";

/* errno error 90 */
"Identifier removed" = "Identyfikator usunięty";

/* errno error 91 */
"No message of desired type" = "Brak komunikatu pożądanego typu";

/* errno error 92 */
"Illegal byte sequence" = "Nielegalna sekwencja bajtów";

/* errno error 93 */
"Attribute not found" = "Atrybut nie został znaleziony";

/* errno error 94 */
"Bad message" = "Zły komunikat";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (Reserved)";

/* errno error 96 */
"No message available on STREAM" = "Na STREAM brak komunikatów";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (Reserved)";

/* errno error 98 */
"No STREAM resources" = "Brak zasobów STREAM";

/* errno error 99 */
"Not a STREAM" = "To nie jest STREAM";

/* errno error 100 */
"Protocol error" = "Błąd protokołu";

/* errno error 101 */
"STREAM ioctl timeout" = "Przekroczenie limitu czasu STREAM ioctl";

/* errno error 102 */
"Operation not supported on socket" = "Ta operacja nie jest obsługiwana w gnieździe";

/* errno error 103 */
"Policy not found" = "Nie znaleziono zasad";
